# Definitions Properties

---
The Definitions type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Identifies if the definitions collection is empty.
| Item| Retrieves a definition by a given name.
| Size| The number of definitions in the collection.
Top
#### Reference
Definitions Class
Autodesk.Revit.DB Namespace